#include <stdint.h>

int main(void){
    *(uint32_t*)(0x40023800UL + 0x30UL) |= 0x02UL; // включаем тактирование GPIOB (RCC)

    *(uint32_t*)(0x40020400UL + 0x00UL) |= 0x4000UL; // настройка пина PB7 на вывод, регистра MODER
    *(uint32_t*)(0x40020400UL + 0x08UL) |= 0x4000UL; // настройка скорости пина PB7 на среднюю
    *(uint32_t*)(0x40020400UL + 0x0CUL) |= 0x00UL; // настройка подтягивающийх/стягивающих регистров PUPDR
    *(uint32_t*)(0x40020400UL + 0x18UL) |= 0x800000UL; // выключение светодиода PB7, BSRR регистр

    while(1){
    *(uint32_t*)(0x40020400UL + 0x18UL) |= 0x80UL; // включение светодиода PB7


}
} 